{
  "footerFootnote": "The Community Health Toolkit (CHT) is a project by a group of leading organizations who have come together to support the development of digital health initiatives in the hardest-to-reach areas. It provides a collection of open source technologies and open access design, technical, and implementer resources that help you build and deploy digital tools for community health. Together, we envision a world where healthcare is of the highest attainable quality, equitable, accessible, and delivered by people who are trusted in their communities.  ",
  "legalInformationLabel": "Legal Information",
  "legalInformationLink": "https://docs.google.com/document/d/1MaI1rgYMNyCZF2eEjBuvnBDoCYHDKlx4k_N5pkDiWu8/edit#heading=h.9sdb6g11dv40",
  "socialLinks": [
    { "href": "https://forum.communityhealthtoolkit.org/", "iconName": "todo" },
    { "href": "https://github.com/medic", "iconName": "github" }
  ],
  "pageHelp": {
    "paragraphs": [
      {
        "headline": "Introduction",
        "values": [
          "Technology is moving fast and new technologies and innovations appear continuously.",
          "It's essential for a development toolkit such as the Community Health Toolkit to constantly improve and keep track with the latest useful innovations. It is important to openly look for innovations and new technologies and to question established technologies and methods every now and then.",
          "But, it is also important to wisely choose which technologies to use in our daily work and in the different projects we are carrying out. As we all know: There is no silver bullet."
        ]
      },
      {
        "headline": "What is the Technology Radar",
        "values": [
          "The CHT Technology Radar for Contributors provides an useful view for developers to know what languages/tools/platforms/techniques to use while contributing to CHT tools themselves."
        ]
      },
      {
        "headline": "Audience",
        "values": [
          "Contributors, developers, engineers"
        ]
      },
      {
        "headline": "How it is created",
        "values": [
          "The items in the technology radar are raised by the different contributors and therefore a lot of the items are related to the work and challenges the contributors face in the different initiatives. In fact, we don't include anything on the radar that we haven't tried ourselves at least once.",
          "There have been a lot of valuable discussions in different expert groups about the classification and details of each of technologies and innovations. And the result of all this can be found in the latest technology radar."
        ]
      },
      {
        "headline": "How should it be used",
        "values": [
          "The radar acts as an overview of technologies that we think everyone in the community should currently know about.",
          "Its goal is to act as a guide and inspiration for the daily work in the community. Its purpose is also to provide helpful information and a bird's-eye perspective - so that decisions can be taken with a much deeper understanding of the subject matter. This results in more informed and coordinated decisions.",
          "We also hope that developers outside of CHT Community find the information in our technology overview inspirational.",
          "We group or categorize the items in 4 quadrants - (sometimes, when it's not 100% clear where a item belongs, we choose the best fit)."
        ]
      }
    ],
    "quadrants": [
      {
        "name": "Languages & Frameworks",
        "description": "These include development languages, as well as more low-level development frameworks, which are useful for implementing custom software of all kinds."
      },
      {
        "name": "Tools",
        "description": "These can be components, such as databases, software development tools, such as versions control systems; or more generic categories of tools, such as the notion of polyglot persistence."
      },
      {
        "name": "Techniques",
        "description": "These include elements of a software development process, such as experience design; and ways of structuring software, such as microservices."
      },
      {
        "name": "Platforms",
        "description": "Things that we build software on top of such as mobile technologies like Android, virtual platforms like the JVM, or generic kinds of platforms like hybrid clouds."
      }
    ],
    "rings": [
      {
        "name": "Adopt",
        "description": "The Adopt ring represents blips that we think you should seriously consider using. We don't say that you should use these for every project; any tool should only be used in an appropriate context. However we do think that a blip in the Adopt ring represents something where there's no doubt that it's proven and mature for use."
      },
      {
        "name": "Trial",
        "description": "The Trial ring is for blips that we think are ready for use, but not as completely proven as those in the Adopt ring. So for most organizations we think you should use these on a trial basis, to decide whether they should be part of your toolkit. Typically we've used trial blips in production, but we realize that readers are more cautious than us."
      },
      {
        "name": "Assess",
        "description": "The Assess ring are things to look at closely, but not necessarily trial yet - unless you think they would be a particularly good fit for you. Typically, blips in the Assess ring are things that we think are interesting and worth keeping an eye on."
      },
      {
        "name": "Stop",
        "description": "The Stop ring is for things that, even though they are accepted in the industry, we haven't had a good experience with. Therefore we are calling them out to warn you that you may run into trouble with them as well. Sometimes it means we think they're irredeemably flawed, or just being misused. We do place things in the Stop ring that we wish the industry wouldn't use."
      }
    ],
    "sourcecodeLink": {
      "href": "https://github.com/medic/cht-tech-radar-contributors",
      "name": "CHT Technology Radar for Contributors on GitHub",
      "description": "Contributions and source code of the CHT Technology Radar for Contributors are on GitHub. Inspired by AOE Tech Radar."
    }
  }
}